Repository: zipf/perldoc-es
Catalog: memory/clean/omegat_clean_prj-level2.tmx
Source language: en_us
Languages: es

source: Even though the object is blessed into the C<C> class, the C<speak()> method in the C<B> class can still call C<SUPER::speak()> and expect it to correctly look in the parent class of C<B> (i.e the class the method call is in), not in the parent class of C<C> (i.e. the class the object belongs to).
es: Incluso si el objeto es bendecido en la clase C<C>, el método C<decir()> de la clase C<B> puede llamar a C<SUPER::decir()> y esperar que se busque correctamente en la clase primaria de C<B> (es decir, la clase dónde se produce la llamada al método) y no en la clase primaria de C<C> (es decir, la clase a la que pertenece el objeto).

source: Even when hidden by L</overriding>, you can always get at a built-in function by L<qualifying|/qualified> its name with the C<CORE::> pseudo-package.
es: Incluso cuando se oculta L<sobrescribiendo|/sobrescribir>, siempre se puede obtener una función predefinida usando su L</nombre completo> (completándolo con el seudopaquete C<CORE::>).

source: Every CPAN module has a bug tracker set up in RT, L<http://rt.cpan.org>.
es: Todo módulo de CPAN tiene un sistema de seguimiento de errores configurado en RT, L<http://rt.cpan.org>.

source: Every L</value> inside Perl is passed around as a C language C<SV*> pointer.
es: En Perl, todo L</valor> se pasa como un puntero C<SV*> del lenguaje C.

source: Every developer publishing modules on CPAN needs a CPAN ID.
es: Para poder publicar módulos en CPAN, un programador necesita un identificador de CPAN.

source: Every variable type has its own namespace, as do several non-variable identifiers.
es: Cada tipo de variable tiene su propio espacio de nombres, al igual que otros tipos de identificadores que no designan variables.

source: Exactly like C:
es: Exactamente igual que en C:

source: Example:
es: Ejemplo:

source: Example: C<perldoc -oLaTeX -dtextwrapdocs.tex Text::Wrap>
es: Ejemplo: C<perldoc -oLaTeX -dtextwrapdocs.tex Text::Wrap>

source: Example: [[:upper:]] matches any uppercase character.
es: Ejemplo: [[:upper:]] coincide con cualquier carácter en mayúscula.

source: Example: [a-z] matches "a" or "b" or "c" ... or "z"
es: Ejemplo: [a-z] coincide con "a" o "b" o "c" ... o "z"

source: Examples of specialized languages that come to mind include prolog and matlab.
es: Algunos ejemplos de lenguajes especializados son prolog y matlab.

source: Examples:
es: Ejemplos:

source: Except where otherwise noted, you should assume that C<use strict> and C<use warnings> statements appear earlier in the "program", and that any variables used have already been declared, even if those declarations have been omitted to make the example easier to read.
es: Salvo si se indica lo contrario, debe suponer que al principio del "programa" se incluyen las instrucciones C<use strict> y C<use warnings>, y que todas las variables han sido declaradas, aunque se omitan las declaraciones para facilitar la lectura del ejemplo.

source: Excessive pride, the sort of thing Zeus zaps you for.
es: Hibris. Orgullo excesivo. El detalle por el que Zeus querría destruirle.

source: Executables for gzip, zip, and VMStar:
es: Ejecutables para gzip, zip y VMStar:

source: Exhaustive information on the topic of references can be found in L<perlreftut>, L<perllol>, L<perlref> and L<perldsc>.
es: Encontrará información detallada sobre las referencias en L<perlreftut>, L<perllol>, L<perlref> y L<perldsc>.

source: Expression syntax corresponds closely to C expression syntax.
es: La sintaxis de expresiones es muy parecida a la de C.

source: Extend your pattern's legibility by permitting whitespace and comments.
es: Mejora la legibilidad del patrón, al permitir espacios en blanco y comentarios.

source: F<a2p> converts F<awk> scripts to Perl programs; for example, C<a2p -F:> on the simple F<awk> script C<{print $2}> will produce a Perl program based around this code:
es: F<a2p> convierte scripts F<awk> en programas Perl; por ejemplo, si ejecuta C<a2p -F:> sobre el sencillo script F<awk> C<{print $2}>, generará un programa Perl basado en el código siguiente:

source: F<c2ph> and F<pstruct>, which are actually the same program but behave differently depending on how they are called, provide another way of getting at C with Perl - they'll convert C structures and union declarations to Perl code.
es: F<c2ph> y F<pstruct> son en realidad el mismo programa, pero se comportan de manera distinta en función de cómo se invoquen. Proporcionan otra manera de incorporar código C en Perl: convierten declaraciones de estructuras y uniones de C en código Perl.

source: F<cpan2dist> is a tool to create distributions (or packages) from CPAN modules, then suitable for your package manager of choice.
es: F<cpan2dist> es una herramienta que permite crear distribuciones (o paquetes) compatibles con distintos administradores de paquetes a partir de módulos de CPAN.

source: F<cpan> is a command-line interface to CPAN.pm.
es: F<cpan> es una interfaz de línea de comandos de CPAN.pm.

source: F<cpanp> is, like F<cpan>, a command-line interface to the CPAN, using the C<CPANPLUS> module as a back-end.
es: F<cpanp> es otra interfaz de línea de comandos de CPAN (una alternativa a F<cpan>) que usa el módulo C<CPANPLUS> como back-end.

source: F<enc2xs> builds a Perl extension for use by Encode from either Unicode Character Mapping files (.ucm) or Tcl Encoding Files (.enc).
es: F<enc2xs> genera una extensión Perl para Encode a partir de archivos de asignación de caracteres Unicode (.ucm) o de archivos de codificación Tcl (.enc).

source: F<h2xs> converts C header files into XS modules, and will try and write as much glue between C libraries and Perl modules as it can.
es: F<h2xs> convierte archivos de encabezado de C en módulos XS y agrega gran parte del código necesario para la comunicación entre bibliotecas C y módulos Perl.

source: F<perlbug> is the recommended way to report bugs in the perl interpreter itself or any of the standard library modules back to the developers; please read through the documentation for F<perlbug> thoroughly before using it to submit a bug report.
es: La manera recomendada de notificar errores del intérprete perl o de cualquier módulo de la biblioteca estándar a sus programadores es usar F<perlbug>; pero antes de usar F<perlbug> debe leer con atención su documentación.

source: F<perldoc> will extract and format the documentation from any file in the current directory, any Perl module installed on the system, or any of the standard documentation pages, such as this one.
es: F<perldoc> extrae y aplica formato a la documentación de cualquier archivo del directorio actual, cualquier módulo Perl instalado en el sistema o cualquiera de las páginas de documentación estándar, como ésta.

source: F<pod2usage> is a special case of F<podselect>, a utility to extract named sections from documents written in POD.
es: F<pod2usage> es un caso especial de F<podselect>, una utilidad que permite extraer secciones con nombre de documentos escritos en formato POD.

source: F<prove> is a command-line interface to the test-running functionality of F<Test::Harness>.
es: F<prove> es una interfaz de línea de comandos de la funcionalidad de ejecución de pruebas de F<Test::Harness>.

source: F<ptar> is a tar-like program, written in pure Perl.
es: F<ptar> es un programa tar escrito en código Perl puro.

source: F<ptardiff> is a small utility that produces a diff between an extracted archive and an unextracted one.
es: F<ptardiff> es una pequeña utilidad que genera las diferencias entre un archivo de almacenamiento extraído y uno sin extraer.

source: F<ptargrep> is a utility to apply pattern matching to the contents of files in a tar archive.
es: F<ptargrep> es una utilidad que aplica detección de patrones al contenido de un archivo de almacenamiento tar.

source: F<s2p> run on C<s/foo/bar> will produce a Perl program based around this:
es: Si se ejecuta F<s2p> sobre C<s/foo/bar>, generará un programa Perl basado en el código siguiente:

source: F<splain> is an interface to L<perldiag> - paste in your error message to it, and it'll explain it for you.
es: F<splain> es una interfaz de L<perldiag>; si le pasa un mensaje de error mostrará una descripción más completa.

source: F<xsubpp> is a compiler to convert Perl XS code into C code.
es: F<xsubpp> es un compilador que permite convertir código XS de Perl en código C.

source: F<xsubpp> will compile XS code into C code by embedding the constructs necessary to let C functions manipulate Perl values and creates the glue necessary to let Perl access those functions.
es: F<xsubpp> compila el código XS y genera código C; para ello, incrusta las construcciones necesarias para que las funciones C puedan manipular valores Perl y agregar el código necesario para que Perl pueda acceder a esas funciones.

source: FUNCTION RETURN LISTS
es: LISTAS RETORNO FUNCIONES

source: Fancy term for L</tokenizing>.
es: Nombre elegante de L</tokenizar>.

source: Fancy term for a L</token>.
es: Nombre elegante de L</token>.

source: Fancy term for a L</tokener>.
es: Nombre elegante de L</tokenizador>.

source: Far More Than Everything You Ever Wanted To Know.
es: I<Far More Than Everything You Ever Wanted To Know> (Mucho más que todo lo que siempre quisiste saber).

source: Favorably in some areas, unfavorably in others.
es: Gana en algunos aspectos y pierde en otros.

source: Fear, Fire,
es: ¡Miedo, fuego,

source: Filtering is achieved by modifying the contents of C<$_>.
es: El filtrado se realiza modificando el contenido de C<$_>.

source: Finally, F<find2perl> translates C<find> commands to Perl equivalents which use the L<File::Find|File::Find> module.
es: Por último, F<find2perl> traduce comandos C<find> en sus equivalentes Perl, que usan el módulo L<File::Find|File::Find>.

source: Finally, because Perl is frequently (but not always, and certainly not by definition) an interpreted language, you can write your programs and test them without an intermediate compilation step, allowing you to experiment and test/debug quickly and easily.
es: Por último, como Perl es frecuentemente un lenguaje interpretado (aunque no siempre y, desde luego, no por definición), puede escribir sus programas y probarlos sin un paso de compilación intermedio, lo que le permite experimentar y probar/depurar de manera rápida y sencilla.

source: Finally, documentation intended for core Perl developers lives in the F<Porting/> directory.
es: Por último, la documentación para programadores del núcleo de Perl se encuentra en el directorio F<Porting/>.

source: Finally, it ships with a C<Mouse::Tiny> module that takes most of C<Mouse>'s features and bundles them up in a single module file.
es: Por último, incluye el módulo C<Mouse::Tiny>, que consta de la mayoría de las características de C<Mouse> y que se empaqueta en un único archivo de módulo.

source: Finally, keep in mind that Perl might not be the right tool for every job.
es: Por último, tenga en cuenta que Perl puede no ser la herramienta adecuada para algunas tareas.

source: Finally, keep in mind that subpatterns created inside a DEFINE block count towards the absolute and relative number of captures, so this:
es: Por último, tenga en cuenta que los subpatrones creados dentro de un bloque DEFINE también cuentan para el número de capturas absolutas y relativas, por lo que:

source: Finally, the "." metacharacter matches any character except "\n" (unless you use C</s>).
es: Por último, el metacarácter "." detecta cualquier carácter salvo "\n" (a menos que se utilice el modificador C</s>).

source: Finally, the documentation.
es: Por último, falta la documentación.

source: Finally, using accessors makes inheritance much simpler.
es: Además, el uso de los métodos de acceso simplifica la herencia.

source: Finally, we have L<Object::Tiny>.
es: Por último, también puede usar L<Object::Tiny>.

source: First In, First Out.
es: First In, First Out (el primero que entra es el primero que sale).

source: First held in Australia it has recently also spread to Israel and France.
es: Se realizó por vez primera en Australia y recientemente se ha extendido también a Israel y Francia.

source: First version July 22, 1998; last revised November 21, 2001.
es: Primera versión: 22 de julio de 1998. Última revisión: 21 de noviembre de 2001.

source: First we locate the code in question - the C<pack> happens at runtime, so it's going to be in one of the F<pp> files.
es: Primero tenemos que buscar el código en cuestión. La función C<pack> se usa en tiempo de ejecución, por lo que estará en uno de los archivos F<pp>.

source: First we need to create a temporary new branch for these changes and switch into it:
es: En primer lugar, debe crear una nueva rama temporal para estos cambios y cambiar a dicha rama:

source: First, are you sure that the module isn't already on your system?
es: Primero debe asegurarse de que el módulo no está instalado en el sistema.

source: First, ensure that you've found an actual bug.
es: En primer lugar, debe asegurarse de que se trata realmente de un error.

source: First, it allows you to separate the public API from the private implementation.
es: En primer lugar, permite separar la API pública de la implementación privada.

source: First, it can be confusing to read.
es: En primer lugar, puede ser confusa al leer el código.

source: First, make sure you have the latest B<cpan-mac> distribution ( http://www.cpan.org/authors/id/CNANDOR/ ), which has utilities for doing all of the steps.
es: En primer lugar, asegúrese de que tiene instalada la distribución más reciente de B<cpan-mac> ( http://www.cpan.org/authors/id/CNANDOR/ ), un módulo que contiene las utilidades necesarias para realizar todos los pasos.

source: First, please read L<perlhack> for details on hacking the Perl core.
es: En primer lugar, lea L<perlhack> para obtener información detallada sobre cómo trabajar en el núcleo de Perl.

source: First, type C<ppm> from a shell and see whether ActiveState's PPM repository has your module.
es: En primer lugar, escriba C<ppm> en una consola y vea si el módulo está disponible en alguno de los repositorios de PPM de ActiveState.

source: First, we'll test that the C<U> does indeed create Unicode strings.
es: En primer lugar, comprobaremos que C<U> crea realmente cadenas Unicode.

source: First, you can append a C<::> to the class name:
es: En primer lugar, puede agregar C<::> al nombre de la clase:

source: Five specially named code blocks are executed at the beginning and at the end of a running Perl program.
es: Hay cinco bloques de código con un nombre especial que se ejecutan al principio y final de la ejecución de un programa Perl.

source: Flags (except C<"d">) may follow the caret to override it.
es: Detrás del signo de intercalación pueden ir modificadores (salvo C<"d">) para anular el efecto.

source: Floating-point numbers are mere approximations of real numbers.
es: Los números de punto flotante son meras aproximaciones de los números reales.

source: Florian 5.13.4 2010-Aug-20
es: Florian 5.13.4 2010-Ago-20

source: Foes!
es: enemigos!

source: For compatibility with older scripts written before __DATA__ was introduced, __END__ behaves like __DATA__ in the top level script (but not in files loaded with C<require> or C<do>) and leaves the remaining contents of the file accessible via C<main::DATA>.
es: Por compatibilidad con I<scripts> antiguos, escritos antes de la introducción de __DATA__, __END__ se comporta como __DATA__ en el I<script> de nivel superior (pero no en los archivos cargados con C<require> o C<do>) y deja el resto del contenido del archivo accesible a través de C<main::DATA>.

source: For example in C<\x{...}>, regardless of the C</x> modifier, there can be no spaces.
es: Por ejemplo, en C<\x{...}> no puede haber espacios, independientemente de que se use el modificador C</x>.

source: For example,
es: Por ejemplo,

source: For example, C<$a += 2> adds C<2> to C<$a>.
es: Por ejemplo, C<$a += 2> suma C<2> a C<$a>.

source: For example, a pair of braces acts as a composer for a hash, and a pair of brackets acts as a composer for an array.
es: Por ejemplo, un par de llaves actúa como un sistema de composición para un hash, y un par de corchetes actúa como un sistema de composición para un array.

source: For example, if it was UTF-8, the individual bytes of multibyte characters are seen as separate characters, and then again converted to UTF-8.
es: Por ejemplo, si la codificación es UTF-8, los bytes individuales de los caracteres multibyte se verán como caracteres independientes y se volverán a convertir a UTF-8.

source: For example, it tests that everyone who is listed in the git log has a corresponding entry in the F<AUTHORS> file.
es: Por ejemplo, comprueban que todas las personas que figuran en el registro de git tienen una entrada correspondiente en el archivo F<AUTHORS>.

source: For example, you could apply a default to an attribute that wasn't set in the constructor, or you could validate that a new value for the attribute is acceptable.
es: Por ejemplo, podemos aplicar un valor predeterminado a un atributo al que no se asignó ningún valor en el constructor o podemos validar un valor nuevo asignado al atributo.

source: For example:
es: Por ejemplo:

source: For example: when matching C<foo|foot> against "barefoot", only the "foo" part will match, as that is the first alternative tried, and it successfully matches the target string.
es: Por ejemplo, cuando se compara C<foo|foot> con "barefoot", solo coincidirá la parte "foo", ya que es la primera alternativa intentada y se detecta correctamente en la cadena.

source: For instance
es: Por ejemplo,

source: For instance the above example could also be written as follows:
es: Por ejemplo, el patrón anterior también se podría escribir de la siguiente manera:

source: For most projects, this information will probably suffice.
es: Sin embargo, es probable que para la mayoría de los proyectos baste con esta información.

source: For C, its only parent is C<File>.
es: La única clase primaria de C es C<Archivo>.

source: For C<\Y|$re\Y|> the variable part of this regular expression needs to be converted explicitly (but only if the special meaning of C<\Y|> should be enabled inside $re):
es: Para C<\Y|$re\Y|>, la parte variable de esta expresión regular debe convertirse explícitamente (pero solo si hay que habilitar el significado especial de C<\Y|> dentro de $re):

source: For C<signal>/C<sigaction>, use C<rsignal(signo, handler)>.
es: Para C<signal>/C<sigaction>, use C<rsignal(signo, handler)>.

source: For URLs, HTTP and HTTPS are the only kind currently supported.
es: Para direcciones URL, actualmente solo se admite HTTP y HTTPS.

source: For Windows machines writing text files, and for certain physical devices like terminals, the single newline gets automatically translated by your C library into a line feed and a carriage return, but normally, no translation is done.
es: En equipos Windows que escriben archivos de texto y en determinados dispositivos físicos como terminales, la biblioteca de C traduce automáticamente el carácter de nueva línea a un avance de línea y un retorno de carro, pero normalmente no hay que hacer esta traducción.

source: For Windows, use a binary version of Perl, L<Strawberry Perl|http://strawberryperl.com/> and L<ActivePerl|http://www.activestate.com/activeperl> come with a bundled C compiler.
es: Para Windows, use una versión binaria de Perl. L<Strawberry Perl|http://strawberryperl.com/> y L<ActivePerl|http://www.activestate.com/activeperl> incluyen un compilador de C.

source: For a description of this, see L<perlref>.
es: Encontrará una descripción de esto en L<perlref>.

source: For a more detailed definition, see L<http://www.opensource.org/osd.html>.
es: Encontrará una definición más detallada en L<http://www.opensource.org/osd.html>.

source: For a more detailed discussion, see L<Unicode::Semantics> on CPAN.
es: Encontrará una descripción más detallada en L<Unicode::Semantics> (disponible en CPAN).

source: For a more help-oriented #perl, check out L<irc://irc.freenode.net/#perl>.
es: Si busca un canal #perl más orientado a la ayuda, pruebe L<irc://irc.freenode.net/#perl>.

source: For a more rigorous (and complicated) view of the rules involved in selecting a match among possible alternatives, see L<Combining RE Pieces>.
es: Para un análisis más riguroso (y complejo) de las normas involucradas en la selección de una coincidencia entre las alternativas posibles, vea L<Combinación de partes de expresiones regulares>.

source: For a regular expression to match, the I<entire> regular expression must match, not just part of it.
es: Para que una expresión regular coincida, debe coincidir la expresión I<entera>, no una parte de ella.

source: For all features that it does implement, the end-user API is I<identical> to C<Moose>, meaning you can switch from C<Mouse> to C<Moose> quite easily.
es: La interfaz final es la misma para todas las características que implementa, de forma que es posible cambiar de C<Mouse> a C<Moose> de forma sencilla.

source: For an example, examine F<perldb.pl> in the Perl library.
es: En el archivo F<perldb.pl> de la biblioteca de Perl encontrará un ejemplo.

source: For an example where side-effects of look-ahead I<might> have influenced the following match, see L</C<< (?>pattern) >>>.
es: En la descripción de L</C<< (?>patrón) >>> encontrará un ejemplo en el que los efectos secundarios de la inspección hacia adelante I<pueden> haber influido en la coincidencia siguiente.

source: For bigger projects, L<Moose> provides a rich set of features that will let you focus on implementing your business logic.
es: Para proyectos más complejos, L<Moose> proporciona un variado conjunto de características que le permitirán centrarse en la implementación de la lógica del sistema.

source: For ease of access, the Perl manual has been split up into several sections.
es: Para facilitar el acceso, el manual de Perl se ha dividido en varias secciones.

source: For example C</(?<!bar)foo/> matches any occurrence of "foo" that does not follow "bar".
es: Por ejemplo C</(?<!bar)foo/> detecta cualquier instancia de "foo" que no siga a "bar".

source: For example C</foo(?!bar)/> matches any occurrence of "foo" that isn't followed by "bar".
es: Por ejemplo, C</foo(?!bar)/> detecta cualquier instancia de "foo" que no esté seguida de "bar".

source: For example if you have C<qr/$a$b/>, and C<$a> contained C<"\g1">, and C<$b> contained C<"37">, you would get C which is probably not what you intended.
es: Por ejemplo, si tiene C<qr/$a$b/>, donde C<$a> contiene C<"\g1"> y C<$b> contiene C<"37">, obtendrá C que, probablemente, no sea lo que pretendía.

source: For example the notation "core: 212 29" in the release 1.000 means that it had in the core 212 kilobytes, in 29 files.
es: Por ejemplo, la notación "core: 212 29" de la versión 1.000 significa que ocupaba 212 kilobytes en el núcleo, distribuidos en 29 archivos.

source: For example, 0.9 cannot be represented by a native float, since the binary fraction for 0.9 is infinite:
es: Por ejemplo, 0.9 no se puede representar como un número de punto flotante nativo porque la fracción binaria correspondiente a 0.9 es infinita:
